Процедура ОбработкаПроведения(Отказ, Режим)	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Сообщить("Не выбран клиент");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если Товары.Количество() = 0 Тогда
		Сообщить("Добавьте хотя бы один товар");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;	
	    // Сначала проверяем остатки    Для Каждого СтрокаТовара Из Товары Цикл        Запрос = Новый Запрос;        Запрос.Текст =        "ВЫБРАТЬ        |   Остатки.КоличествоОстаток КАК КоличествоОстаток        |ИЗ        |   РегистрНакопления.ОстаткиТоваров.Остатки(        |       ,        |       Товар = &Товар        |   ) КАК Остатки";        Запрос.УстановитьПараметр(            "Товар",            СтрокаТовара.Товар        );        Результат = Запрос.Выполнить().Выбрать();        Остаток = 0;        Если Результат.Следующий() Тогда            Остаток = Результат.КоличествоОстаток;        КонецЕсли;        Если Остаток < СтрокаТовара.Количество Тогда            Сообщить(                "Недостаточно товара: "                + Строка(СтрокаТовара.Товар)                + ". Остаток: "                + Строка(Остаток)            );            Отказ = Истина;            Возврат;        КонецЕсли;    КонецЦикла;    // Если остатков хватает — делаем расход    Движения.ОстаткиТоваров.Записывать = Истина;    Для Каждого СтрокаТовара Из Товары Цикл        Движение =            Движения.ОстаткиТоваров.Добавить();        Движение.ВидДвижения =            ВидДвиженияНакопления.Расход;        Движение.Период = Дата;        Движение.Товар = СтрокаТовара.Товар;        Движение.Количество = СтрокаТовара.Количество;	КонецЦикла;   
	
	Для Каждого СтрокаТовара Из Товары Цикл   
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Товар) Тогда
			Сообщить("В одной из строк не выбран товар");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		Если СтрокаТовара.Количество <= 0 Тогда
			Сообщить(            "Количество товара должно быть больше нуля: "            + Строка(СтрокаТовара.Товар)	        );	        Отказ = Истина;	        Возврат;	
		КонецЕсли;
		
		Если СтрокаТовара.Цена < 0 Тогда
			Сообщить(	            "Цена товара не может быть отрицательной: "	            + Строка(СтрокаТовара.Товар)	        );	        Отказ = Истина;	        Возврат;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	КонецПроцедуры