&НаКлиентеПроцедура ТоварыКоличествоПриИзменении(Элемент)    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;    Если ТекущаяСтрока = Неопределено Тогда        Возврат;    КонецЕсли;    ТекущаяСтрока.Сумма =        ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;    ПересчитатьИтог();КонецПроцедуры&НаКлиентеПроцедура ТоварыЦенаПриИзменении(Элемент)    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;    Если ТекущаяСтрока = Неопределено Тогда        Возврат;    КонецЕсли;    ТекущаяСтрока.Сумма =        ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;    ПересчитатьИтог();КонецПроцедуры  

&НаСервереБезКонтекстаФункция ПолучитьЦенуТовара(Товар)    Если НЕ ЗначениеЗаполнено(Товар) Тогда        Возврат 0;    КонецЕсли;    Возврат Товар.Цена;КонецФункции&НаКлиентеПроцедура ПересчитатьИтог()    Объект.ИтоговаяСумма = 0;    Для Каждого СтрокаТовара Из Объект.Товары Цикл        Объект.ИтоговаяСумма =            Объект.ИтоговаяСумма + СтрокаТовара.Сумма;    КонецЦикла;КонецПроцедуры

&НаСервереФункция ПечатьНаСервере()    ТабДок = Новый ТабличныйДокумент;    Макет = Документы.Продажа.ПолучитьМакет("ПечатьПродажи");    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");    ОбластьШапка.Параметры.Номер = Объект.Номер;    ОбластьШапка.Параметры.Дата = Объект.Дата;    ОбластьШапка.Параметры.Клиент = Объект.Клиент;    ТабДок.Вывести(ОбластьШапка);    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");    ТабДок.Вывести(ОбластьШапкаТаблицы);    ОбластьСтрокаТовара = Макет.ПолучитьОбласть("СтрокаТовара");    Для Каждого СтрокаТовара Из Объект.Товары Цикл        ОбластьСтрокаТовара.Параметры.Товар = СтрокаТовара.Товар;        ОбластьСтрокаТовара.Параметры.Количество = СтрокаТовара.Количество;        ОбластьСтрокаТовара.Параметры.Цена = СтрокаТовара.Цена;        ОбластьСтрокаТовара.Параметры.Сумма = СтрокаТовара.Сумма;        ТабДок.Вывести(ОбластьСтрокаТовара);    КонецЦикла;    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");    ОбластьПодвал.Параметры.ИтоговаяСумма = Объект.ИтоговаяСумма;    ТабДок.Вывести(ОбластьПодвал);    Возврат ТабДок;КонецФункции
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьНаСервере();    
	ТабДок.Показать("Продажи");
КонецПроцедуры


